recipes/enchilada-bake.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Enchilada Bake</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="james" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content">
<h1 class="title">Enchilada Bake</h1>
<p>
<a href="https://gamechangersmovie.com/recipes/enchilada-bake-casserole/">Original link - From Game Changers</a>
</p>

<div id="outline-container-orge1adec4" class="outline-2">
<h2 id="orge1adec4">Ingredients</h2>
<div class="outline-text-2" id="text-orge1adec4">
</div>
<div id="outline-container-org2a10365" class="outline-3">
<h3 id="org2a10365">Red Enchilada Sauce</h3>
<div class="outline-text-3" id="text-org2a10365">
<ul class="org-ul">
<li>1 can whole peeled tomatoes</li>
<li>1 jar (350g) Roasted Red Peppers, drained</li>
<li>1 small can tomato paste</li>
<li>1/2 jar (75g) pickled jalapenos</li>
<li>1/2 onion, roughly diced</li>
<li>1 garlic clove, chopped</li>
<li>1 tablespoon cumin</li>
<li>1 teaspoon black pepper</li>
<li>1/2 teaspoon salt</li>
</ul>
</div>
</div>

<div id="outline-container-orgda66152" class="outline-3">
<h3 id="orgda66152">Bean and Rice Filling</h3>
<div class="outline-text-3" id="text-orgda66152">
<ul class="org-ul">
<li>1/2 teaspoon onion, granulated</li>
<li>2 cups cooked brown rice</li>
<li>2 cans black beans</li>
<li>1 cup corn kernels</li>
<li>200g bag baby spinach</li>
<li>1 teaspoon cumin</li>
<li>1/2 teaspoon smoked paprika</li>
<li>1/2 teaspoon onion granulated</li>
<li>1/2 teaspoon salt</li>
</ul>
</div>
</div>

<div id="outline-container-org6bbffe5" class="outline-3">
<h3 id="org6bbffe5">Sweet Potato Queso</h3>
<div class="outline-text-3" id="text-org6bbffe5">
<ul class="org-ul">
<li>2 sweet potatoes, peeled and roughly chopped (roughly 400 g)</li>
<li>5 garlic cloves</li>
<li>1 bay leaf</li>
<li>2 cups unsweetened soy milk or unsweetened plant-based milk</li>
<li>1 cup fresh or jar salsa</li>
<li>1 tablespoon nutritional yeast (optional)</li>
<li>1 teaspoon cumin</li>
<li>3/4 teaspoon chili powder</li>
<li>1/2 teaspoon smoked paprika</li>
<li>1/2 teaspoon salt</li>
<li>1/2 teaspoon black pepper</li>
</ul>
</div>
</div>

<div id="outline-container-orgc3ae3b5" class="outline-3">
<h3 id="orgc3ae3b5">Other</h3>
<div class="outline-text-3" id="text-orgc3ae3b5">
<ul class="org-ul">
<li>8-10 tortillas (whole wheat or corn)</li>
<li>Vegetable stock</li>
<li>1 teaspoon black pepper</li>
<li>Classic Sour Cream recipe (optional)</li>
<li>Hot sauce of choice (optional)</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-orgeee65bd" class="outline-2">
<h2 id="orgeee65bd">Method</h2>
<div class="outline-text-2" id="text-orgeee65bd">
<ol class="org-ol">
<li><b>For the Red Enchilada Sauce</b>: Heat a medium size saucepan on medium high heat, add the onions and garlic and saute for 1 min. Add the remaining ingredients. Bring to a slow boil, lower the heat to medium-low and cook for 15 minutes, stirring often. Remove from the stove top and let cool. When cool, add the mixture to a blender and blend to chunky-smooth consistency. Set aside.</li>
<li><b>For the Bean and Rice Filling</b>: Wilt the baby spinach in a steamer or large saucepan pan by cooking on a medium high heat for 1 minute. Add all ingredients to a large bowl and mix well. Set aside.</li>
<li><b>For the Sweet Potato Queso</b>: In small sauce pot, add the first 3 ingredients, add water to cover, and on medium-high heat bring to a boil for 10-12 minutes until the sweet potatoes are soft (can break apart with a fork) and about half the liquid has evaporated. Remove from the stove top and let cool. Remove the bay leaf. Add the cooked sweet potato mixture to a blender, add the seasonings and 1 cup of plant based milk (to start) and blend on low speed moving to high speed for roughly 2 minutes until silky smooth. Add extra plant milk for a thinner sauce and less for thicker. Remember sauce will thicken once cooled or if heated. You can always add more liquid but you cannot take it away, so add the plant milk gradually.</li>
<li>For Assembly: (think of building a lasagna, kinda. Have all the components ready to build). Preheat the oven to 180&deg;C. Warm the tortillas by wrapping in foil and baking in a hot oven for 5 minutes OR put them in the microwave for 1 minute. (Makes easier to wrap). In a large casserole dish, add large ladle of red enchilada sauce as a base. In each tortilla add ¾ cup of the filling and roll. Place each filled tortilla side by each into the casserole dish until the dish is full. Cover the tortillas evenly with Red Enchilada Sauce, drizzle Queso sauce over each roll, cover with tin foil (optional), and bake for 25-30 minutes until hot. Remove the tin foil and bake for an additional 5 minutes. Remove from the oven. Slice down the middle length-wise, scoop to serve or build individual meal prep containers for a few days-worth of meals. Garnish with drizzle of Classic Sour Cream, your favorite hot sauce and fresh coriander. Add more or less salt and pepper to your taste.</li>
</ol>
</div>
</div>
</div>
</body>
</html>
